{"wrapper":"div.bm-pdp-faq","sections":{"main":{"type":"bm-faq-section","blocks":{"e06c0fb0-af12-434e-ab5c-44153d6d920e":{"type":"faq-left","settings":{"title":"Does Utiva Cranberry PACs work?","description":"<p>Yes. Utiva Cranberry PACs is a great option to prevent UTIs as our product guarantees 36mg of Proanthocyanidins (PACs for short). PACs have a special ability: anti-adhesion as it interferes with the harmful bacteria to stop them from sticking to the bladder wall, minimizing risk of infection. When taking Utiva daily, around the same time this results in natural flushing of bacteria when urinating. It is important to take Utiva around the same time as it works on a 24 hour cycle.<\/p>"}},"d09060f5-be00-4cc4-86f5-781c59bb554b":{"type":"faq-left","settings":{"title":"What is the recommended dosage of Utiva Cranberry PACs?","description":"<p>Utiva Cranberry PACs is recommended to be taken as per the following:<br\/><br\/><strong>PREVENTION:<\/strong>1 capsule daily at the same time every day<br\/><br\/>SEX-ASSOCIATED or SYMPTOMATIC: 2 capsules the day of and 2 capsules 24 hours later. It is safe to take 2 capsules a day for a few days if needed.<br\/><br\/>Utiva Cranberry PACs can be taken with or without food.<\/p>"}},"69a2577b-05e7-497b-889d-57006ea7ca7e":{"type":"faq-left","settings":{"title":"How long does it take for Utiva Cranberry PACs to work?","description":"<p>Utiva Cranberry PACs can provide benefits almost immediately in terms of how you feel. For long term UTI prevention, it is best advised to take Utiva daily and observe the benefits of breaking away from UTIs or experience a huge reduction of UTI reoccurrences. Antibiotics are always required to clear the infection and then the real long term prevention kicks in!<\/p>"}},"09f536d5-7a12-4477-909a-a801ab8f0a4b":{"type":"faq-left","settings":{"title":"Is Utiva Cranberry PACs safe for people who have a history of kidney stones?","description":"<p>Most cranberry products are known to have high levels of Oxalates which can aggravate kidney stones as the majority of kidney stones are formed when oxalate binds to calcium while urine is produced by the kidneys. Utiva Cranberry PACs is unique because it only has trace amounts of Oxalates due to our unique extraction process.  We also do third party testing of our formulation to verify oxalate levels. We do recommend checking with your doctor before starting any new supplement.<\/p>"}},"be43bb09-83e5-468f-b0d9-2d7c68772f7f":{"type":"faq-left","settings":{"title":"Is Utiva Cranberry PACs a treatment for UTIs?","description":"<p>No. Treatment of UTIs is still recommended to be antibiotics due to the evidence available. Natural products are recommended for prevention only.<\/p>"}},"7a7d6876-4036-4067-bab0-cee7c61b6db7":{"type":"faq-left","settings":{"title":"Are there any side effects or drug interactions with Utiva Cranberry PACs?","description":"<p>There are no known side effects with Utiva Cranberry PACs unless you are allergic to cranberries. Typically cranberry products are known to have high levels of Vitamin K and Oxalates. These can interfere with blood thinners and aggravate kidney stones. Utiva Cranberry PACs has removed the Vitamin K and only has trace amounts of Oxalates.<\/p>"}},"41e9722a-5e71-4ca7-b265-188c0a68512a":{"type":"faq-left","settings":{"title":"Do I need to stop taking Utiva Cranberry PACs while on antibiotics?","description":"<p>Utiva Cranberry PACs is safe to take while on antibiotics and can also help ensure PACs are in your system to prevent further bacteria from sticking.<\/p>"}},"a3b55dcb-c855-4409-9bf1-82e45768b68a":{"type":"faq-left","settings":{"title":"Is Utiva Cranberry PACs safe while Pregnant?","description":"<p>Utiva Cranberry PACs supplement is made of 100% natural cranberry and there is no studied risk for using cranberry products during pregnancy. Multiple clinical trials have been completed. <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3924191\/\" title=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3924191\/\">Check out this Norwegian study that observed the effects of cranberries on 100,000 pregnancies.<\/a><\/p>"}},"b518af9e-021c-4618-bb31-23cba3c0af5d":{"type":"faq-left","settings":{"title":"Is Utiva Cranberry PACs safe for long term use?","description":"<p>Yes! Utiva Cranberry PACs is safe for long term prevention. Most patients finding benefit are taking Utiva Cranberry PACs daily ongoing.<\/p>"}},"6521c0c7-3d9e-4885-ba4b-d7798b2b16d1":{"type":"faq-left","settings":{"title":"Sex and UTIs or any triggers (eg swimming , travelling)","description":"<p><strong>SEX-ASSOCIATED or SYMPTOMATIC<\/strong>Dosage: 2 capsules the day of and 2 capsules 24 hours later. It is safe to take 2 capsules a day for a few days if needed.<\/p>"}},"cffffb9f-e6a8-4982-8d2e-5dddedb6d369":{"type":"faqs-right","settings":{"title":"Is Utiva Cranberry PACs dairy free and soy free","description":"<p>Yes<\/p>"}},"4bbfc480-392d-406c-adb1-249c92dabf1c":{"type":"faqs-right","settings":{"title":"What are the ingredients in Utiva Cranberry PACs?","description":"<p>Each capsule of Utiva Cranberry PACs contains 240mg of Urophenol™️ - Cranberry (Vaccinium macrocarpon) fruit extract providing 15% proanthocyanidins (PACs) = 36mg PAC per BL-DMAC method, Inactive Ingredients hypromellose, magnesium stearate, and rice flour<\/p>"}},"31dfc61c-44b3-4ee2-b8d2-f359bd13869f":{"type":"faqs-right","settings":{"title":"Can Utiva Cranberry PACs aggravate IC (Interstitial cystitis)?","description":"<p>Cranberry can lower the pH and an acidic environment is know to aggravate IC. We do have many patients with IC though. Some take an alkaline agent as well to balance the pH and others just continue with it and so they can get the benefits of Utiva Cranberry PACs. We advise you to consult your doctor regarding this.<\/p>"}},"c6bf9419-87f2-484c-b3e7-3345541ae75b":{"type":"faqs-right","settings":{"title":"Why is Utiva Cranberry PACs is so expensive?","description":"<p>Unlike most cranberry products, Utiva Cranberry PACs always discloses the amount of active molecules we have. In providing 36mg of PACs (measure by DMAC\/A2) from cranberries, Utiva Cranberry PACs is a clinically proven option to help prevent UTI's. This will help reduce the need for antibiotics, which can have negative side effects, including antibiotic resistance.<\/p>"}},"e1a7ceab-3ea7-4144-8b59-7cb06eff6380":{"type":"faqs-right","settings":{"title":"What can I do if I can not swallow the capsule?","description":"<p>You can open capsule and put the powder in apple sauce, yogurt, juice, cereal, smoothie or anything you like. This makes it easier for kids or the elderly. We do not recommend putting Utiva Cranberry PACs in anything hot.<\/p>"}},"efda66e5-c20a-4012-af9c-220346c4d8cb":{"type":"faqs-right","settings":{"title":"Where can I buy Utiva products?","description":"<p><a href=\"https:\/\/utivahealth.ca\/\">Utivahealth.ca<\/a>, Rexall, Amazon.ca, Well.ca, Healthy Planet, and many other health food stores and pharmacies.<\/p>"}},"97edd770-c4b0-4e9f-ad9d-4b53812e897f":{"type":"faqs-right","settings":{"title":"How much PAC is in Utiva Cranberry PACs vs. the competition?","description":"<p>Most cranberry supplements have low amount of PACs, we at Utiva will always disclose the amount of active molecules we have. In providing 36 mg of PACs from cranberries, Utiva Cranberry PACs is a clinically proven option to help prevent UTI's. This will help reduce the need for antibiotics, which can have negative side effects, including antibiotic resistance. We encourage you to look for PAC content (measured by DMAC\/A2 method) on competitor labels and share if you find it.<\/p>"}},"6c32949c-1fa7-4307-b0e2-63a988e590a8":{"type":"faqs-right","settings":{"title":"I have more questions, how do I contact you?","description":"<p>You can contact us via email, phone or direct messaging on Facebook or Instagram. You can always refer to our website for more resources, tips and for general information.(https:\/\/www.utivahealth.ca\/). Our customer care number is 1-888-622-3613. Our lines are open Monday to Friday from 9am to 6pm EST.<\/p>"}},"60aaca7f-dfe9-4b04-83b9-8b2cd0559141":{"type":"faqs-right","settings":{"title":"What are the benefits of auto-refill?","description":"<p>Auto-refill offer the convenience to receive supplements every 3 months and ensure you never run out. All our auto-refill customers always have first preference for new material, stock and any events we carry out. There are also additional savings with every auto-refill order.<\/p>"}},"4373c8ef-3ea6-4dbe-b556-31f56282d3ae":{"type":"faqs-right","settings":{"title":"What is the shelf-life of Utiva Cranberry PACs?","description":"<p>Utiva Cranberry PACs has a 3 year shelf-life from the time of production. The expiration date can be found on the package.<\/p>"}}},"block_order":["e06c0fb0-af12-434e-ab5c-44153d6d920e","d09060f5-be00-4cc4-86f5-781c59bb554b","69a2577b-05e7-497b-889d-57006ea7ca7e","09f536d5-7a12-4477-909a-a801ab8f0a4b","be43bb09-83e5-468f-b0d9-2d7c68772f7f","7a7d6876-4036-4067-bab0-cee7c61b6db7","41e9722a-5e71-4ca7-b265-188c0a68512a","a3b55dcb-c855-4409-9bf1-82e45768b68a","b518af9e-021c-4618-bb31-23cba3c0af5d","6521c0c7-3d9e-4885-ba4b-d7798b2b16d1","cffffb9f-e6a8-4982-8d2e-5dddedb6d369","4bbfc480-392d-406c-adb1-249c92dabf1c","31dfc61c-44b3-4ee2-b8d2-f359bd13869f","c6bf9419-87f2-484c-b3e7-3345541ae75b","e1a7ceab-3ea7-4144-8b59-7cb06eff6380","efda66e5-c20a-4012-af9c-220346c4d8cb","97edd770-c4b0-4e9f-ad9d-4b53812e897f","6c32949c-1fa7-4307-b0e2-63a988e590a8","60aaca7f-dfe9-4b04-83b9-8b2cd0559141","4373c8ef-3ea6-4dbe-b556-31f56282d3ae"],"settings":{"cranberry_heading":"Cranberry PACs FAQ","Cranberry":"Cranberry_PACs"}},"276d8c51-08df-4122-9aa4-5678c6fb565b":{"type":"bm-faq-section","blocks":{"422db0f7-e710-486b-a6eb-97e4d929340b":{"type":"faq-left","settings":{"title":"Does the Probiotic work?","description":"<p>Yes! Utiva’s Probiotic is an excellent probiotic option providing necessary strains to improve gut and urinary tract health. At the total value of 30 Billion CFU, at time of manufacture, the optimal required amount of probiotics are being provided. Additionally, our DR Capsules are vegetable based and specially created to ensure delivery of sensitive probiotic strains past the gut for targeted delivery.<\/p>"}},"975030f3-34ac-4034-b98f-2ca53812c4f9":{"type":"faq-left","settings":{"title":"How long do I have to wait to see the effects?","description":"<p>It is usually recommended to take natural products for a minimum of 4 weeks to see beneficial results but some will experience health benefits much earlier. It is important to take your Probiotic diligently every day to ensure optimal efficacy. Probiotics are often a long term process to regain and maintain your optimal gut health so please be patient!<\/p>"}},"fa74a66b-9201-453f-9015-0671b5b27222":{"type":"faq-left","settings":{"title":"Does the Probiotic interact with other supplements and antibiotics?","description":"<p>When taking antibiotics, it is recommended to take any probiotic 2-3 hours before\/after taking your antibiotic. Aside from this, there are no known interactions with Probiotic and any other medication or supplements.<\/p>"}},"6e6d0d44-61cd-446a-b36a-a7ff6134a9ee":{"type":"faq-left","settings":{"title":"Is it dairy-free and soy-free?","description":"<p>Yes! Utiva Probiotic is dairy-free and soy-free. It is a very clean formulation that is safe for all adult populations.<\/p>"}},"26b97eec-a890-432a-a29d-9ce1e5a9e8c0":{"type":"faq-left","settings":{"title":"Do I need to refrigerate Probiotic?","description":"<p>No. Utiva Probiotic is shelf stable at room temperature. Being individually packed in blister packs also ensures improved stability with less exposure to air. Should you wish to refrigerate it, there is no harm in doing so.<\/p>"}}},"block_order":["422db0f7-e710-486b-a6eb-97e4d929340b","975030f3-34ac-4034-b98f-2ca53812c4f9","fa74a66b-9201-453f-9015-0671b5b27222","6e6d0d44-61cd-446a-b36a-a7ff6134a9ee","26b97eec-a890-432a-a29d-9ce1e5a9e8c0"],"settings":{"cranberry_heading":"Probiotic FAQ","Cranberry":"Probiotic"}},"cfcc5587-6151-4583-9dcf-f991f829b064":{"type":"bm-faq-section","blocks":{"c4c63fd5-a7db-4a74-8d81-1d7231e8ac74":{"type":"faq-left","settings":{"title":"What are the ingredients in Utiva Bladder Health?","description":"<p>Each capsule has only one active ingredient, a pure 250mg proprietary full-spectrum cranberry extract (Flowens) of the seeds, skin, flesh, and juice. Non-medical ingredients include a small amount of hypromellose, magnesium stearate, and rice flour.<\/p>"}},"f82d4bce-07b1-462e-8e55-5f20e67eb1b4":{"type":"faq-left","settings":{"title":"Does Utiva Bladder Health work?","description":"<p>Yes. Utiva Bladder Health is clinically proven to help reduce overactive bladder and lower urinary tract symptoms. Taking 2 capsules a day is promised to help with 57% reduction in urgency, 40% reduction in your bladder feeling full and 16% reduction in the frequency of bathroom visits.<\/p>"}},"28f0ad44-bb41-46d9-bbfa-afc3f2e5264b":{"type":"faq-left","settings":{"title":"How does Utiva Bladder Health work?","description":"<p>It is believed that our proprietary full-spectrum cranberry extract (Flowens) has an indirect immune, antioxidant, and anti-inflammatory response. This helps improve the microbiome, thereby reducing the onset of inflammation and having a positive impact on the relief of LUTS & OAB symptoms.<\/p>"}},"e3f95137-b213-4ee2-a392-5ceb63f9872d":{"type":"faq-left","settings":{"title":"How is Utiva Bladder Health different than Utiva Cranberry PACs?","description":"<p>Utiva Bladder Health has a unique extract (Flowens) derived from different components of the cranberries with hardly any PACs. It is clinically supported for overactive bladder and Utiva Cranberry PACs with the 36 mg of PACs is clinically supported to help in the maintenance of recurring UTIs.<\/p>"}},"339bc156-ea49-438b-8f91-baf225b1a5aa":{"type":"faq-left","settings":{"title":"How does it compare to medications?","description":"<p>Utiva Bladder Health is all-natural and does not cause the side effects such as dry mouth, constipation and stomach upset that typical OAB medications do. It is best to be tried as an alternative or adjunct to medications.<\/p>"}},"c4ef8c6c-47f3-45a6-82c9-a0d0ed722f60":{"type":"faq-left","settings":{"title":"How long do I need to take it for?","description":"<p>Utiva Bladder Health is recommended to be taken daily for a minimum of 4-6 weeks to start experiencing its benefits. This supplement is meant to be taken every day and ongoing to keep your bladder healthy.<\/p>"}},"15f1d9c6-3e15-4c7e-aebe-df041a686945":{"type":"faq-left","settings":{"title":"What is the recommended dosage for Utiva Bladder Health?","description":"<p>Take 2 capsules daily to help reduce overactive bladder (OAB). Take 1 capsule daily to help support normal urinary functions and improve lower urinary tract symptoms (LUTS). The capsules can be taken at the same time and can be taken with or without food.<\/p>"}},"b930fe28-40c5-4703-b406-7c7485468cba":{"type":"faq-left","settings":{"title":"Does it have any side effects?","description":"<p>There are no known side effects with Utiva Bladder Health unless you are allergic to cranberries. Typically cranberry products are known to have high levels of Vitamin K and Oxalates. These can interfere with blood thinners and aggravate kidney stones. It is always best to check with your Healthcare Practitioner if you have any specific concerns.<\/p>"}},"e558e5fe-670e-4950-befd-6c006b76cf90":{"type":"faq-left","settings":{"title":"Is this only for women?","description":"<p>No. Utiva Bladder Health was created for both men and women.<\/p>"}},"3ed2a75c-61ff-48e1-90c4-131082c507f5":{"type":"faq-left","settings":{"title":"Is Utiva Bladder Health safe for long term use?","description":"<p>Yes. Utiva Bladder Health is safe for long term use and most effective when used on a daily basis.<\/p>"}},"9ebf5f18-70e5-47b7-a37c-2fa923349446":{"type":"faq-left","settings":{"title":"What if Utiva Bladder Health does not work for me?","description":"<p>With our 30 day money back guarantee program, we encourage you to try Utiva to ensure you are fully satisfied with your purchase. If you feel, Utiva Bladder Health has not worked for you and you wish to request a refund, please contact us within 30 days of your purchase at hello@utivahealth.com or call us at 1-800-622-3613 and we will process your return.<\/p>"}},"d0f8fcff-7279-43a2-b64c-fd0f52c91343":{"type":"faq-left","settings":{"title":"Can I take Bladder Health as an alternative to Cranberry PACs?","description":"<p>Utiva Bladder Health is not to be used as an alternative to Cranberry PACs, as it is not a solution for UTI prevention. However, Utiva Bladder Health and Cranberry PACs can be taken together.<\/p>"}},"362e7ce7-fb30-4fbc-8a6d-7a7a7b021516":{"type":"faq-left","settings":{"title":"Is Utiva Bladder Health safe for those with dietary restrictions?","description":"<p>Yes! Utiva Bladder Health is 100% natural, vegan, dairy-free, soy-free, gluten-free, halal and GMO-free.<\/p>"}},"cfe4bdb7-4cbe-4746-810d-bd88649e5c06":{"type":"faq-left","settings":{"title":"What is the shelf-life of Utiva Bladder Health?","description":"<p>Utiva Bladder Health has a 3 year shelf-life from the time of production. The expiration date can be found on the package.<\/p>"}}},"block_order":["c4c63fd5-a7db-4a74-8d81-1d7231e8ac74","f82d4bce-07b1-462e-8e55-5f20e67eb1b4","28f0ad44-bb41-46d9-bbfa-afc3f2e5264b","e3f95137-b213-4ee2-a392-5ceb63f9872d","339bc156-ea49-438b-8f91-baf225b1a5aa","c4ef8c6c-47f3-45a6-82c9-a0d0ed722f60","15f1d9c6-3e15-4c7e-aebe-df041a686945","b930fe28-40c5-4703-b406-7c7485468cba","e558e5fe-670e-4950-befd-6c006b76cf90","3ed2a75c-61ff-48e1-90c4-131082c507f5","9ebf5f18-70e5-47b7-a37c-2fa923349446","d0f8fcff-7279-43a2-b64c-fd0f52c91343","362e7ce7-fb30-4fbc-8a6d-7a7a7b021516","cfe4bdb7-4cbe-4746-810d-bd88649e5c06"],"settings":{"cranberry_heading":"Bladder Health FAQ","Cranberry":"Bladder_Health"}},"b106151e-9856-4674-9dab-a66a9589ad61":{"type":"bm-faq-section","blocks":{"ef3844af-1030-431c-b746-bffa52f6e5f0":{"type":"faq-left","settings":{"title":"How does D-Mannose work?","description":"<p>D-Mannose is a form of sugar that may prevent UTIs by stopping bacteria from attaching to the bladder lining. It is believed that D-Mannose attaches itself to the E.coli strain, which accounts for over 70% of all UTI-causing bacteria. There have been clinical studies to show that D-Mannose is effective along with feedback from doctors and consumers that D-Mannose helps to prevent UTIs. Even though evidence is limited, and it is not in UTI prevention guidelines, it can certainly help those facing chronic and\/or trigger associated UTIs.<\/p>"}},"39347a20-24e2-499d-bc53-6f66d5c4023a":{"type":"faq-left","settings":{"title":"What’s the difference between D-Mannose and Cranberry PACs (36mg PAC)?","description":"<p>D-Mannose is another high-quality supplement for UTI prevention from Utiva which focuses on the E.coli bacteria. We recommend it when someone has complicated recurrent UTIs or has trigger-associated UTIs (such as sex, swimming, travel, etc). It recommended to take at least 2,000mg daily of D-Mannose.<\/p><p>Utiva Cranberry PACs is a clinically proven cranberry extract that binds to most bacteria, including E.coli. PACs are the bioactive molecule of the cranberry and physician guidelines recommend it. Utiva Cranberry PACs is a simple, small, once-a-day pill taken for daily support of the urinary tract to prevent ongoing UTIs. PACs are also the antioxidant of the cranberry and provide other gut health benefits.<\/p><p>For those patients who are chronic and are looking for a stronger approach to prevent UTIs, we recommend taking Cranberry PACs and D-Mannose together.<\/p>"}},"7e5c6a97-c4fb-4ab6-bd83-8dc02fb7c92b":{"type":"faq-left","settings":{"title":"Can I take D-Mannose and Cranberry PACs (36mg PAC) at the same time?","description":"<p>It is safe to take PACs and D-Mannose together. However, we suggest taking each ingredient separately as some preliminary research shows that D-Mannose may lower the effectiveness of PACs when taken at the same time. <\/p><p>Our recommendation is the PACs to be taken at the same time daily; preferably at night so that the PACs can sit in your bladder longer (while you sleep). D-Mannose can be taken during the day.<\/p>"}},"bd17caa1-5c5d-4bec-b61c-639e771111d1":{"type":"faq-left","settings":{"title":"What role does D-Mannose have with IC (interstitial cystitis)?","description":"<p>If you are having UTIs and feel there is a likelihood that the acidity of cranberry can irritate you, D-Mannose is a great option to consider. It will help fight specifically against Ecoli infections and has minimal impact on pH levels causing little to no irritation.<\/p>"}},"59d7d843-5c5c-45b5-b207-4e83b4bdeacb":{"type":"faq-left","settings":{"title":"What are the side effects of D-Mannose?","description":"<p>Side effects of D-Mannose may include bloating and loose stools. There is evidence that D-mannose may impact sugar levels, so people living with diabetes may want to consult a physician first. High doses of D-Mannose may also cause kidney damage.<\/p><p> <\/p><p>Always tell your doctor about any supplements you are taking, including natural ones and those bought without a prescription. That way, your doctor can check on any potential side effects or interactions with any medications.<\/p>"}},"bdf59f79-528f-4966-9971-0cd4a27efb71":{"type":"faq-left","settings":{"title":"What is the shelf-life of Utiva D-Mannose?","description":"<p>Utiva D-Mannose has a 3 year shelf-life from the time of production. The expiration date can be found on the package.<\/p>"}}},"block_order":["ef3844af-1030-431c-b746-bffa52f6e5f0","39347a20-24e2-499d-bc53-6f66d5c4023a","7e5c6a97-c4fb-4ab6-bd83-8dc02fb7c92b","bd17caa1-5c5d-4bec-b61c-639e771111d1","59d7d843-5c5c-45b5-b207-4e83b4bdeacb","bdf59f79-528f-4966-9971-0cd4a27efb71"],"settings":{"cranberry_heading":"D-Mannose FAQ","Cranberry":"D_Mannose"}},"bedc06f0-b228-4fc0-99ce-1c9c3cd387fb":{"type":"bm-faq-section","blocks":{"22a6b620-49f2-4d62-a550-678be360a577":{"type":"faq-left","settings":{"title":"Can I use these UTI Test Strips instead of going to see my doctor?","description":"<p>The UTI test strips are convenient and easy to use for screening a UTI in the comfort of your home.  It is advisable to use it only if you experience any of the UTI symptoms. If you show a positive result, you must immediately see your doctor. However, if you show a negative result but have symptoms, we still advise you to consult with your healthcare provider.<\/p>"}},"92c09dbd-bc18-4295-8586-35b32108ec46":{"type":"faq-left","settings":{"title":"How accurate is the test?","description":"<p>The Utiva UTI test strips are clinically accurate. These rapid tests are similar to what some clinics use to quickly screen for a UTI before doing a urine culture.  The results of the UTI test strips have been compared to another commercial test. The study shows 94.4% accuracy for the Leukocyte test and 98.4% for the Nitrite test.<\/p>"}},"cfef984e-c4b7-406f-8a8d-72fd858dc543":{"type":"faq-left","settings":{"title":"How do I interpret the results?","description":"<p>Once you have urinated on the Utiva UTI test strip mid-stream or dipped the test strip in a collection of urine. Start a timer for 2 minutes.  <\/p><p>Start off by referencing the colour chart that is<strong> <\/strong>on the front of the test strip package. The top pad of the test strip tests for Leukocytes and the bottom pad tests for Nitrates.<\/p><p>You will want to read the result and look for a color change at one minute for Nitrate (bottom pad) and two minutes for Leukocytes (top pad). <\/p><p>Read the results by comparing and matching the test pad(s) to the colour blocks on the colour chart. The chart indicates which colour block combinations suggest a negative or positive result. <\/p><p>If you test positive, you should immediately consult a doctor. If you are unsure of your results, consult your physician and do not ignore your UTI symptoms.<\/p>"}},"d9a91be1-2d65-4070-9682-f8e839363d8a":{"type":"faq-left","settings":{"title":"Is there a time that is best to take the test?","description":"<p>Yes, the best time to perform the test is with the first morning urine. However if that is not possible based on when the UTI symptoms present themselves, you can use this UTI test anytime during the day. The UTI test should be avoided during your menstrual period.<\/p>"}},"f9684230-431f-49aa-9504-fdf99e7a458b":{"type":"faq-left","settings":{"title":"Do certain foods, alcohol or common medications affect the test?","description":"<p>In general, most substances will not interfere with the test. Consult your physician if you are taking antibiotics. Some medications (e.g. Vitamin B2) can affect the colour of your urine and may cause false results. Large quantities of Vitamin C may cause false negative results.<\/p>"}},"5fd0df84-03b6-40f6-b7a1-dd015154d549":{"type":"faq-left","settings":{"title":"Are there limitations of the UTI Test?","description":"<p>Yes.Under certain conditions, you may receive a negative test result even though you have a UTI. This can be due to a few reasons: your UTI is caused by bacteria that does not change nitrate to nitrite, when urine has not been held in the bladder for more than 4 hours, when taking antibiotics, or when your diet does not include nitrates. <\/p>"}},"3fadd5dc-2c11-4395-bc61-421a2e1053be":{"type":"faq-left","settings":{"title":"Can men use these UTI Test Strips?","description":"<p>Absolutely! Utiva UTI Test Strips can be used by anyone.<\/p>"}}},"block_order":["22a6b620-49f2-4d62-a550-678be360a577","92c09dbd-bc18-4295-8586-35b32108ec46","cfef984e-c4b7-406f-8a8d-72fd858dc543","d9a91be1-2d65-4070-9682-f8e839363d8a","f9684230-431f-49aa-9504-fdf99e7a458b","5fd0df84-03b6-40f6-b7a1-dd015154d549","3fadd5dc-2c11-4395-bc61-421a2e1053be"],"settings":{"cranberry_heading":"UTI Test Strips FAQ","Cranberry":"UTI_Diagnostic_Test_Strips"}},"1a483089-3127-46fe-bff2-4d755f80902c":{"type":"bm-faq-section","blocks":{"620ee8d9-9226-4477-9adf-0cb0ffca0953":{"type":"faq-left","settings":{"title":"When should I use the Cleansing Wipes?","description":"<p>These wipes can be used when you need quick soothing, cooling, or hygiene cleansing. Each pack contains 15 wipes that are small enough to carry around and use when on-the-go. Be sure to wipe front-to-back whenever you want to freshen up whether that be after sex, exercise or long periods of travel.<\/p>"}},"cc66bb8f-1450-4710-82ae-fba245bf847c":{"type":"faq-left","settings":{"title":"Will the Cleansing Wipes affect my natural pH-balance?","description":"<p>No. The Utiva Cleansing wipes are pH balanced and will not disturb the natural vaginal environment as they are free of fragrance, alcohol, Parabens and Phthalates.<\/p>"}},"7c2683fd-67af-4aab-b471-4b49c8e1e92d":{"type":"faq-left","settings":{"title":"Are the Cleansing Wipes flushable?","description":"<p>Yes, Utiva Cleansing Wipes are locally-made with flushable grade fabric but we recommend checking with local guidelines on acceptance of flushing wipes. The flushability is tested on the paper substrate (or fabric) in accordance with the current INDA\/EDANA guidelines. However, if your home is on a septic system, it is recommended that you refrain from flushing wipes down the toilet.<\/p>"}},"6da98d14-0da7-42ce-9bc1-601699252cac":{"type":"faq-left","settings":{"title":"Are the Cleansing Wipes alcohol free?","description":"<p>The wipes are also free of allergens, parabens, sulfates, sulfates, dyes, phthalates, and chlorine bleach. <\/p>"}},"40885e2a-db81-4093-ae1b-6562285b931a":{"type":"faq-left","settings":{"title":"Are the Cleansing Wipes scented?","description":"<p>No, the wipes have no fragrance added to the formulation.<\/p>"}}},"block_order":["620ee8d9-9226-4477-9adf-0cb0ffca0953","cc66bb8f-1450-4710-82ae-fba245bf847c","7c2683fd-67af-4aab-b471-4b49c8e1e92d","6da98d14-0da7-42ce-9bc1-601699252cac","40885e2a-db81-4093-ae1b-6562285b931a"],"settings":{"cranberry_heading":"Cleansing Wipes FAQ","Cranberry":""}},"a79fe2b1-110d-497a-8543-320427dd4828":{"type":"bm-faq-section","blocks":{"33ad6a7c-4529-40f4-a2f7-9fd5c447a38b":{"type":"faq-left","settings":{"title":"Is Prostate Health Safe?","description":"<p>Every ingredient in Utiva Prostate Health is carefully sourced with a long-standing history of safety and effectiveness. Utiva Prostate Health is tested by a third party laboratory to ensure that the supplement matches the USP and Health Canada standards to ensure we produce only high quality and safe natural products. Our manufacturing facilities are all based in Canada and are Health Canada monitored.<\/p>"}},"b04da543-0f0c-4cb3-bed9-b6967c604a56":{"type":"faq-left","settings":{"title":"How many capsules should I take?","description":"<p>Thanks to the potency of Utiva Prostate Health, all you need is 1 softgel a day.<\/p>"}},"4f6404a3-ca94-4d3d-b916-b265cbda2c10":{"type":"faq-left","settings":{"title":"How long does it take to work?","description":"<p>Some men find symptoms improve in as little at 6 weeks, while in others it can take a little longer. So remember to be patient and above all, be consistent.<\/p>"}},"2821f04f-aa08-4b45-9378-47cc8de70ae5":{"type":"faq-left","settings":{"title":"What time of day should I take Utiva Prostate Health?","description":"<p>For best results, Utiva Prostate Health may be taken at night before bed so the natural ingredients can provide relief throughout the day. Utiva Prostate Health can be taken with or without food. To minimize gastric disturbances, take with food.<\/p>"}},"ad58c660-d91b-4778-9b69-6aa96d0bb0ec":{"type":"faq-left","settings":{"title":"Is Utiva Prostate Health for long-term use?","description":"<p>Yes, Utiva Prostate Health is designed to help support your prostate and provide relief as you age.<\/p>"}},"06be8d46-f642-4f8a-b59a-d43217f39c44":{"type":"faq-left","settings":{"title":"Can I take Utiva Prostate Health alongside my prescription medications or other prostate supplements? ","description":"<p>Prescription medication: Utiva Prostate Health is safe to take alongside prescription medicine. Always consult your healthcare practitioner when stopping medications or changing doses. <\/p><p>Other prostate supplements: Utiva Prostate Health is designed to be a complete prostate supplement. We do not recommend other manufacturers’ products as we cannot ensure they are of high quality or safe.<\/p>"}}},"block_order":["33ad6a7c-4529-40f4-a2f7-9fd5c447a38b","b04da543-0f0c-4cb3-bed9-b6967c604a56","4f6404a3-ca94-4d3d-b916-b265cbda2c10","2821f04f-aa08-4b45-9378-47cc8de70ae5","ad58c660-d91b-4778-9b69-6aa96d0bb0ec","06be8d46-f642-4f8a-b59a-d43217f39c44"],"settings":{"cranberry_heading":"Prostate Health FAQ","Cranberry":"Prostate_Health"}},"46aad9a5-a3ab-4950-903a-cd51fd7c2395":{"type":"bm-faq-section","blocks":{"058d0576-996b-4271-9903-11d7372d8fb4":{"type":"content","settings":{"medical_heading":"HSA Medical Form","medical_description":"<p>In Canada, natural products may be paid for from your HSA (Health Savings Account) when certain criteria is met. Please verify with your health insurance company to verify what you are eligible for. A healthcare provider is typically required to prescribe or fill out a form that specifies what is being recommended, what condition is it helping with and for how long it should be taken. This form can be downloaded for your healthcare provider to fill out by <a href=\"https:\/\/cdn.shopify.com\/s\/files\/1\/0060\/4677\/7455\/files\/Utiva_HSA_FSA_Form_-_Canada_Fillable.pdf?v=1654738994\" target=\"_blank\"><span style=\"text-decoration:underline\">CLICKING HERE.<\/span><\/a><\/p>"}}},"block_order":["058d0576-996b-4271-9903-11d7372d8fb4"],"settings":{"cranberry_heading":"","Cranberry":""}},"eb7f3d55-ca99-429a-9991-adf4ed93eb33":{"type":"bm-faq-section","blocks":{"805e95f5-bdf9-4568-ac7b-d193543fb183":{"type":"faq-left","settings":{"title":"How much is shipping and when do you ship?","description":"<p>At Utiva, we offer free shipping on orders over $50 and therefore most of products already quality for this. Orders that are placed before 11am will ship out the same day. Order placed after 11am will ship the following business day.<\/p>"}},"25b30eb0-5992-46e4-abc4-abcd5803a897":{"type":"faq-left","settings":{"title":"What is the return policy for the supplement?","description":"<p>Utiva has a 30 day money back guarantee. We encourage you to try Utiva and want to ensure you are fully satisfied with your purchase. Should you wish to request a refund, please contact us within 30 days of your purchase at<a href=\"mailto:hello@utivahealth.com\">hello@utivahealth.com<\/a>or call us at 1-800-622-3613 and we will process your return.<\/p>"}},"1040ffbd-6821-433d-8544-9401b0dd1b9c":{"type":"faq-left","settings":{"title":"How long will my order take?","description":"<p><em>All orders received before 11:00 AM are shipped same-day.<\/em><\/p><p><em>GTA and Ontario<\/em> orders are delivered the following day for 1-4 business days.<\/p><p><em>Rest of Canada<\/em> is approximately 2-6 business days.<\/p>"}},"8a727722-514d-414d-b2ea-64515a6205b2":{"type":"faq-left","settings":{"title":"International shipping","description":"<p>International shipping is available through our US site. Please visit us at www.utivahealth.com.<\/p>"}},"cdea9224-76cb-4409-84ae-30df25c729d5":{"type":"faq-left","settings":{"title":"How can I update my order, delivery address once the order is submitted?","description":"<p>For any changes to an existing order, please email us at <a href=\"mailto:hello@utivahealth.com\">hello@utivahealth.com<\/a> and\/or call us at 1-888-622-3613.<\/p>"}},"1cefcb04-b398-4ee6-8d0f-27cfdeab2b27":{"type":"faq-left","settings":{"title":"","description":""}}},"block_order":["805e95f5-bdf9-4568-ac7b-d193543fb183","25b30eb0-5992-46e4-abc4-abcd5803a897","1040ffbd-6821-433d-8544-9401b0dd1b9c","8a727722-514d-414d-b2ea-64515a6205b2","cdea9224-76cb-4409-84ae-30df25c729d5","1cefcb04-b398-4ee6-8d0f-27cfdeab2b27"],"settings":{"cranberry_heading":"Shipping & Return policy","Cranberry":""}},"32ee14a6-3c7e-4120-9466-b3a79c6b5def":{"type":"bm-faq-section","blocks":{"590cc1ef-b976-49b0-8936-77ec55b23eb1":{"type":"faq-left","settings":{"title":"How do I check my rewards?","description":"<p>When you log into your account and scroll to the bottom, you will see a welcome message with your Rewards points balance. If you would like to review your rewards history, click on the button below that says<strong>Reward History<\/strong>.<\/p>"}},"85889c5b-3880-43bc-bff0-2bb7e66a41af":{"type":"faq-left","settings":{"title":"How do I earn points?","description":"<p>You can earn Utiva Rewards by making a purchase, referring a friend to Utiva (points will reflect once your friend makes a purchase), following us on social media, downloading our UTI Tracker App, joining our Facebook group. You’ll even earn points just by joining our program and every time you celebrate your birthday.<\/p>"}},"3e1eb97f-55e8-4281-80db-613e3a87a8d2":{"type":"faq-left","settings":{"title":"Is joining your rewards program free?","description":"<p>Utiva Rewards program is completely free to join. All you have to do is sign up.<\/p>"}},"df9b845a-771f-4765-96cc-1c7148c230f9":{"type":"faq-left","settings":{"title":"I am on auto refill; do I still get awarded points for my purchases?","description":"<p>Yes, your points will automatically be added to your account each time we ship your order.<\/p>"}},"d314b698-1cd1-4131-8db3-e0c2c60a2c82":{"type":"faq-left","settings":{"title":"Can I use my reward points and a discount coupon code at the same time?","description":"<p>When redeeming points at checkout for a discount, you will not be able to use the auto generated Utiva Rewards redemption code in combination with another discount code. For example, during a sale period you will not be able to combine your sale discount code with your points redemption code. You can however use a gift card at the same time as you are redeeming<br\/>your rewards.<\/p>"}},"65a68857-086e-409d-b73e-910b554472bf":{"type":"faq-left","settings":{"title":"What if I already have a Utiva account, do I still get the points awarded just for creating an account?","description":"<p>If you’ve already created a Utiva account you already started to earn points, log in so you can take actions that will give you even more points.<\/p>"}},"443904de-8b55-4e41-bc63-7962afeff9ad":{"type":"faq-left","settings":{"title":"Do Utiva Reward points expire?","description":"<p>Your Utiva Reward points don’t expire. So, you are free to use them whenever you want without the worry of your points expiring!<\/p>"}},"e895b77a-6267-4d9f-a5d6-89bbfdef1072":{"type":"faq-left","settings":{"title":"If I cancel my order, do I still get the points?","description":"<p>If you cancel your order, your rewards points will also be cancelled. Points are also cancelled if you’re your order status is voided, refunded, or partially<br\/>refunded.<\/p>"}},"e609e958-baf1-45a0-acd1-1f54221b6bb3":{"type":"faq-left","settings":{"title":"How does the referral program work?","description":"<p>Once enrolled, share your unique link provided in your Rewards widget with your friends. Your friend will receive a 25% coupon code and once your friend makes a purchase you will be automatically be rewarded with a $20 off coupon code.<\/p>"}},"950a116a-d315-4463-9810-988fa9a79304":{"type":"faq-left","settings":{"title":"How do I get points for following Utiva on social media?","description":"<p>Once you’ve created your account, go back to our Rewards page and follow the prompts. If you already follow Utiva on our social channels, simply click on the buttons on the rewards page until you’ve collected them.<\/p>"}},"b461f1fd-ad33-4bb9-bfce-a8c74b578c6f":{"type":"faq-left","settings":{"title":"How do I collect my birthday points?","description":"<p>50 points will be automatically awarded to your rewards account each year on the day of your birthday.<\/p>"}}},"block_order":["590cc1ef-b976-49b0-8936-77ec55b23eb1","85889c5b-3880-43bc-bff0-2bb7e66a41af","3e1eb97f-55e8-4281-80db-613e3a87a8d2","df9b845a-771f-4765-96cc-1c7148c230f9","d314b698-1cd1-4131-8db3-e0c2c60a2c82","65a68857-086e-409d-b73e-910b554472bf","443904de-8b55-4e41-bc63-7962afeff9ad","e895b77a-6267-4d9f-a5d6-89bbfdef1072","e609e958-baf1-45a0-acd1-1f54221b6bb3","950a116a-d315-4463-9810-988fa9a79304","b461f1fd-ad33-4bb9-bfce-a8c74b578c6f"],"settings":{"cranberry_heading":"Utiva Rewards","Cranberry":""}}},"order":["main","276d8c51-08df-4122-9aa4-5678c6fb565b","cfcc5587-6151-4583-9dcf-f991f829b064","b106151e-9856-4674-9dab-a66a9589ad61","bedc06f0-b228-4fc0-99ce-1c9c3cd387fb","1a483089-3127-46fe-bff2-4d755f80902c","a79fe2b1-110d-497a-8543-320427dd4828","46aad9a5-a3ab-4950-903a-cd51fd7c2395","eb7f3d55-ca99-429a-9991-adf4ed93eb33","32ee14a6-3c7e-4120-9466-b3a79c6b5def"]}